Podkova/src/InformationRegisters/ОписаниеGTINИС/ОписаниеGTINИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписаниеGTINИС</name>
  <comment>Информация о стандартных упаковках маркируемой продукции</comment>
  <attributes>
    <name>ВидУпаковки</name>
    <type>
      <types>EnumRef.ВидыУпаковокИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>GTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/InformationRegisters/ПулКодовМаркировкиСУЗ/ПулКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПулКодовМаркировкиСУЗ</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиСУЗ</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияУправленияЗаказами</name>
    <type>
      <types>CatalogRef.СтанцииУправленияЗаказамиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйКодМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЭмиссииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПечатиУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>GTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяРозничнаяЦена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>EnumRef.ШаблоныКодовМаркировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипШтрихкода</name>
    <type>
      <types>EnumRef.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркировкаОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаказаСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторБлокаСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаЭмиссию</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСуммаКодаМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/ДетализацияСтруктурыХраненияИС/ДетализацияСтруктурыХраненияИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДетализацияСтруктурыХраненияИС</name>
  <enumValues>
    <name>Полная</name>
  </enumValues>
  <enumValues>
    <name>ПалетыСМонотоварнымиКоробами</name>
    <comment>Палеты с коробками (до идентификации состава, например по GTIN)</comment>
  </enumValues>
  <enumValues>
    <name>КоробаСГрупповымиУпаковками</name>
    <comment>Короба с бутылками (ЕГАИС), короба с потребительскими упаковками (ИСМП), коробки с блоками (МОТП)</comment>
  </enumValues>
  <enumValues>
    <name>ГрупповыеУпаковки</name>
    <comment>Бутылки, потребительские упаковки (ИСМП), пачки (МОТП), блоки без детализации состава (МОТП)</comment>
  </enumValues>
  <enumValues>
    <name>ГрупповыеУпаковкиСПотребительскими</name>
    <comment>блоки и пачки (МОТП), блоки с детализацией состава - для видов продукции с групповыми товарными упаковками</comment>
  </enumValues>
  <enumValues>
    <name>ПотребительскиеУпаковки</name>
    <comment>Пачки (МОТП) - для видов продукции с групповыми товарными упаковками</comment>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ПрочиеЗоныПересчетаПродукцииИСМП/ПрочиеЗоныПересчетаПродукцииИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПрочиеЗоныПересчетаПродукцииИСМП</name>
  <enumValues>
    <name>ПачкиБезБлока</name>
  </enumValues>
  <enumValues>
    <name>БлокиБезКоробки</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияБезУпаковки</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ВидыУпаковокИС/ВидыУпаковокИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУпаковокИС</name>
  <enumValues>
    <name>Логистическая</name>
  </enumValues>
  <enumValues>
    <name>Групповая</name>
  </enumValues>
  <enumValues>
    <name>Потребительская</name>
  </enumValues>
  <enumValues>
    <name>Неопределен</name>
  </enumValues>
  <enumValues>
    <name>АкцизнаяМаркаСНомеромИСерией</name>
  </enumValues>
  <enumValues>
    <name>АгрегированныйТаможенныйКод</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ВидыПродукцииИС/ВидыПродукцииИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииИС</name>
  <enumValues>
    <name>Алкогольная</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ШаблоныКодовМаркировкиСУЗ/ШаблоныКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ШаблоныКодовМаркировкиСУЗ</name>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>БлокТабачныхПачек</name>
  </enumValues>
  <enumValues>
    <name>ТабачнаяПачка</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>СкоропортящаясяМолочнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезУказанияСроковГодностиВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>ДухиКомплект</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленностьКомплект</name>
  </enumValues>
  <enumValues>
    <name>ФотоаппаратыКомплект</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабакБлок</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабакПачка</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабакПачкаGS1</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияСерия6СимволовВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияСерия6СимволовБезВЕТИС</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/CommonModules/ПроверкаИПодборПродукцииМОТП/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область РасчетХешСумм

// Пересчитывает хеш-суммы всех упаковок формы и проверяется необходимость перемаркировки.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма проверки и подбора маркируемой продукции.
//
Процедура ПересчитатьХешСуммыВсехУпаковок(Форма) Экспорт

	Если Не Форма.ПроверятьНеобходимостьПеремаркировки Тогда
		Возврат;
	КонецЕсли;

	Если Форма.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки Тогда
		Форма.КоличествоУпаковокКоторыеНеобходимоПеремаркировать = 0;
		ПроверкаИПодборПродукцииМОТПКлиентСервер.ОтобразитьИнформациюОНеобходимостиПеремаркировки(Форма);
		Возврат;
	КонецЕсли;
	
	ТаблицаХешСумм = ПроверкаИПодборПродукцииИС.ПустаяТаблицаХешСумм();
	
	Для Каждого СтрокаДерева Из Форма.ДеревоМаркированнойПродукции.ПолучитьЭлементы() Цикл
		Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(СтрокаДерева.ТипУпаковки)
		 Или СтрокаДерева.ТипУпаковки = Перечисления.ПрочиеЗоныПересчетаПродукцииИСМП.БлокиБезКоробки Тогда
			ПроверкаИПодборПродукцииИС.РассчитатьХешСуммыУпаковки(СтрокаДерева, ТаблицаХешСумм, Истина);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПеремаркировки = ПроверкаИПодборПродукцииИС.ТаблицаПеремаркировки(ТаблицаХешСумм);
	
	ПроверкаИПодборПродукцииМОТПКлиентСервер.ПроверитьНеобходимостьПеремаркировки(Форма, ТаблицаПеремаркировки, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетДопустимойДетализацииСтруктурыХраненияПоДокументу

// Возвращает допустимые детализации структуры хранения по документу, доступные при открытии формы проверки и подбора.
// Параметры:
//  ПроверяемыйДокумент - ДокументСсылка - ссылка на проверяемый документ, для которого производится открытие формы.
//
// Возвращаемое значение:
//  Массив - массив из ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС.
Функция ДопустимыеДетализацииСтруктурыХраненияПоДокументу(ПроверяемыйДокумент) Экспорт
	
	ВозможныеДетализации = Новый Массив;
	ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.Полная);
	ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими);
	ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки);
	
	Если ТипЗнч(ПроверяемыйДокумент) <> Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами);
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
	КонецЕсли;
	
	Возврат ВозможныеДетализации;
	
КонецФункции

// Возвращает список допустимых детализаций по фактической детализации документа
// 
// Параметры:
//  ФактическаяДетализация - ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - Фактическая детализация.
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - Допустимые детализации
Функция ДетализацияТребуетЗапросаКСервису(ФактическаяДетализация) Экспорт
	
	ДетализацииТребующиеЗапросаКСервису = Новый Массив;
	
	Если ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами Тогда
		ДетализацииТребующиеЗапросаКСервису.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
	КонецЕсли;
	
	Если ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
		Или ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
		ДетализацииТребующиеЗапросаКСервису.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки);
	КонецЕсли;
	
	Если ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
		Или ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками
		Или ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки Тогда
		ДетализацииТребующиеЗапросаКСервису.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими);
	КонецЕсли;
	
	Если ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
		Или ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками
		Или ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки
		Или ФактическаяДетализация = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими Тогда
		ДетализацииТребующиеЗапросаКСервису.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки);
	КонецЕсли;
	
	ДетализацииТребующиеЗапросаКСервису.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.Полная);
	
	Возврат ДетализацииТребующиеЗапросаКСервису;
	
КонецФункции

// Возвращает детализацию структуры хранения, рассчитанную по данным статистики по документу.
// 
// Параметры:
//  ДанныеШтрихкодовСписок - ТаблицаЗначений - таблица штрихкодов упаковок проверяемого документа. (См ШтрихкодированиеМОТП.ШтрихкодыУпаковокИзДокумента).
//  ПараметрыСканирования - (См. ШтрихкодированиеИСКлиент.ПараметрыСканирования).
//  ПроверяемыйДокумент - ДокументСсылка - ссылка на проверяемый документ.
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид продукции.
//  Кэш - Неопределено, Соответствие - кэш.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - детализация структуры хранения.
Функция ДетализацияНаОснованииСтатистикиПоШтрихкодам(ДанныеШтрихкодовСписок, ПараметрыСканирования, ПроверяемыйДокумент, ВидПродукции, Кэш = Неопределено) Экспорт
	
	КоличествоПалет   = 0;
	КоличествоКоробов = 0;
	КоличествоБлоков  = 0;
	КоличествоПачек   = 0;
	
	Кэш = Новый Соответствие;
	
	ДоступнаКолонкаВидУпаковки = Ложь;
	Если ТипЗнч(ДанныеШтрихкодовСписок) = Тип("Соответствие") Тогда
		ИмяКолонкиШтрихкод         = "Ключ";
		ДоступнаКолонкаВидУпаковки = Истина;
	ИначеЕсли ТипЗнч(ДанныеШтрихкодовСписок) = Тип("Массив")
		Или ТипЗнч(ДанныеШтрихкодовСписок) = Тип("ТаблицаЗначений") Тогда
		ИмяКолонкиШтрихкод = "Штрихкод";
	КонецЕсли;
	
	Для Каждого ДанныеШтрихкода Из ДанныеШтрихкодовСписок Цикл
		
		КодМаркировки = ДанныеШтрихкода[ИмяКолонкиШтрихкод];
		
		ПримечаниеКРезультатуРазбора = Неопределено;
		
		ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(КодМаркировки, ВидПродукции, ПримечаниеКРезультатуРазбора);
		
		Кэш[КодМаркировки] = Новый Структура("ДанныеРазбора, ПримечаниеКРезультатуРазбора", ДанныеРазбора, ПримечаниеКРезультатуРазбора);
		
		Если ДанныеРазбора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДоступнаКолонкаВидУпаковки
			И Не ЗначениеЗаполнено(ДанныеРазбора.ВидУпаковки)
			И ЗначениеЗаполнено(ДанныеШтрихкода.Значение.ВидУпаковки) Тогда
			ДанныеРазбора.ВидУпаковки = ДанныеШтрихкода.Значение.ВидУпаковки;
		КонецЕсли;
		
		Если ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			Если ДанныеРазбора.СоставКодаМаркировки.Свойство("GTIN")
				И ЗначениеЗаполнено(ДанныеРазбора.СоставКодаМаркировки.GTIN) Тогда
				КоличествоКоробов = КоличествоКоробов + 1;
			Иначе
				КоличествоПалет = КоличествоПалет + 1;
			КонецЕсли;
		ИначеЕсли ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
			КоличествоБлоков = КоличествоБлоков + 1;
		ИначеЕсли ДанныеРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			КоличествоПачек = КоличествоПачек + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ВозможныеДетализации = Новый Массив;
	
	Если ТипЗнч(ПроверяемыйДокумент) = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.Полная);
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими);
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки);
	ИначеЕсли КоличествоПалет > 0 Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами);
	ИначеЕсли КоличествоКоробов >= 25 Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами);
	ИначеЕсли КоличествоКоробов >= 5 Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
	ИначеЕсли КоличествоБлоков >= 250 Тогда
		ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
	Иначе
		
		Если ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП Тогда
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.Полная);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими);
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки);
		Иначе
			
			// ГрупповыеУпаковки не поддерживаются в форме проверки
			
			Если КоличествоПачек > 0
				И КоличествоБлоков = 0
				И КоличествоКоробов = 0
				И КоличествоПалет = 0 Тогда
				ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки);
			КонецЕсли;
			
			Если КоличествоПалет = 0 Тогда
				ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками);
			КонецЕсли;
			
			ВозможныеДетализации.Добавить(Перечисления.ДетализацияСтруктурыХраненияИС.Полная);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыСканирования.ДетализацияСтруктурыХранения) Тогда
		Возврат ВозможныеДетализации[0];
	ИначеЕсли ВозможныеДетализации.Найти(ПараметрыСканирования.ДетализацияСтруктурыХранения) = Неопределено Тогда
		Возврат ВозможныеДетализации[0];
	ИначеЕсли ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
		Или ПараметрыСканирования.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
		Возврат Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками;
	КонецЕсли;
	
	Возврат ПараметрыСканирования.ДетализацияСтруктурыХранения;
	
КонецФункции

#КонецОбласти

Процедура ОпределитьВидыУпаковокДляАльтернативногоТабака(Штрихкоды, КешДанныхРазбора, ДанныеРазбораШтрихкода) Экспорт
	
	Если Штрихкоды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокEAN   = Новый Массив;
	СписокGTIN  = Новый Массив;
	EANШтрихкод = Новый Соответствие;
	
	Для Каждого Штрихкод Из Штрихкоды Цикл
		ДанныеРазбора = КешДанныхРазбора[Штрихкод].ДанныеРазбора;
		Если Неопределено = ДанныеРазбора
			Или ЗначениеЗаполнено(ДанныеРазбора.ВидУпаковки)
			Или Не ДанныеРазбора.СоставКодаМаркировки.Свойство("EAN")
			Или Не ЗначениеЗаполнено(ДанныеРазбора.СоставКодаМаркировки.EAN) Тогда
			Продолжить;
		КонецЕсли;
		EAN = ДанныеРазбора.СоставКодаМаркировки.EAN;
		Если EANШтрихкод[EAN] = Неопределено Тогда
			EANШтрихкод[EAN] = Новый Массив;
			СписокEAN.Добавить(EAN);
			СписокGTIN.Добавить(ДанныеРазбора.СоставКодаМаркировки.GTIN);
		КонецЕсли;
		EANШтрихкод[EAN].Добавить(Штрихкод);
	КонецЦикла;
	
	Если СписокEAN.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПоШтрихкодамEAN = ШтрихкодированиеИС.ДанныеПоШтрихкодамEAN(СписокEAN);
	Для Каждого СтрокаТЧ Из ДанныеПоШтрихкодамEAN Цикл
		Если СтрокаТЧ.ВидПродукции <> Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаТЧ.Коэффициент > 1 Тогда
			ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая;
		Иначе
			Продолжить;
		КонецЕсли;
		Для Каждого Штрихкод Из EANШтрихкод[СтрокаТЧ.ШтрихкодEAN] Цикл
			ДанныеРазбораШтрихкода[Штрихкод].ВидУпаковки         = ВидУпаковки;
			КешДанныхРазбора[Штрихкод].ДанныеРазбора.ВидУпаковки = ВидУпаковки;
		КонецЦикла;
		ИндексЭлемента = СписокEAN.Найти(СтрокаТЧ.ШтрихкодEAN);
		СписокEAN.Удалить(ИндексЭлемента);
		СписокGTIN.Удалить(ИндексЭлемента);
	КонецЦикла;
	
	Если СписокEAN.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПоGTIN = РегистрыСведений.ОписаниеGTINИС.ПолучитьОписание(СписокGTIN);
	НеизвестныхДанныхПоGTIN = СписокGTIN.Количество();
	Для ИндексЭлемента = 0 По СписокGTIN.ВГраница() Цикл
		GTIN         = СписокGTIN[ИндексЭлемента];
		ОписаниеGTIN = ДанныеПоGTIN[GTIN];
		Если ОписаниеGTIN = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВидУпаковки = ОписаниеGTIN.ВидУпаковки;
		EAN         = СписокEAN[ИндексЭлемента];
		Для Каждого Штрихкод Из EANШтрихкод[EAN] Цикл
			ДанныеРазбораШтрихкода[Штрихкод].ВидУпаковки         = ВидУпаковки;
			КешДанныхРазбора[Штрихкод].ДанныеРазбора.ВидУпаковки = ВидУпаковки;
		КонецЦикла;
		НеизвестныхДанныхПоGTIN = НеизвестныхДанныхПоGTIN - 1;
	КонецЦикла;
	
	Если НеизвестныхДанныхПоGTIN > 0 Тогда 
		ДанныеПулаПоКодамМаркировки = РегистрыСведений.ПулКодовМаркировкиСУЗ.ДанныеКодовМаркировки(Штрихкоды);
		Для Каждого СтрокаПула Из ДанныеПулаПоКодамМаркировки Цикл 
			Штрихкод = СтрокаПула.КодМаркировки;
			ВидУпаковки = ?(СтрокаПула.Шаблон = Перечисления.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакБлок, Перечисления.ВидыУпаковокИС.Групповая, Перечисления.ВидыУпаковокИС.Потребительская);
			ДанныеРазбораШтрихкода[Штрихкод].ВидУпаковки         = ВидУпаковки;
			КешДанныхРазбора[Штрихкод].ДанныеРазбора.ВидУпаковки = ВидУпаковки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
